{"class_name": "Sequential", "config": [{"class_name": "ZeroPadding2D", "config": {"name": "b1_zp1", "trainable": true, "batch_input_shape": [null, 1, 128, 43], "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"name": "b1_c1", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "b1_a1", "trainable": true, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"name": "b1_zp2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"name": "b1_c2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "b1_a2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "b1_mp1", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"name": "b1_d1", "trainable": true, "rate": 0.25}}, {"class_name": "ZeroPadding2D", "config": {"name": "b2_zp1", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"name": "b2_c1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "b2_a1", "trainable": true, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"name": "b2_zp2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"name": "b2_c2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "b2_a2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "b2_mp1", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"name": "b2_d1", "trainable": true, "rate": 0.25}}, {"class_name": "ZeroPadding2D", "config": {"name": "b3_zp1", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"name": "b3_c1", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "b3_a1", "trainable": true, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"name": "b3_zp2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"name": "b3_c2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "b3_a2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "b3_mp1", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"name": "b3_d1", "trainable": true, "rate": 0.25}}, {"class_name": "ZeroPadding2D", "config": {"name": "b4_zp1", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"name": "b4_c1", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "b4_a1", "trainable": true, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"name": "b4_zp4", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"name": "b4_c2", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "b4_a2", "trainable": true, "activation": "relu"}}, {"class_name": "GlobalMaxPooling2D", "config": {"name": "b4_gmp1", "trainable": true, "data_format": "channels_first"}}, {"class_name": "Dense", "config": {"name": "b5_fc1", "trainable": true, "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "b5_a1", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "b5_d1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "b5_output", "trainable": true, "units": 6, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "keras_version": "2.0.8", "backend": "tensorflow"}